{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"config": {"kernel_regularizer": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "name": "conv2d_1", "strides": [2, 2], "dtype": "float32", "kernel_size": [5, 5], "dilation_rate": [1, 1], "batch_input_shape": [null, 100, 100, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_constraint": null, "name": "conv2d_2", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_regularizer": null, "filters": 64, "activity_regularizer": null, "kernel_constraint": null, "name": "conv2d_3", "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "units": 128, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_2", "units": 12, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}